app/controllers/votes_controller.rb

  def create
    @vote = Vote.new(params[:vote])
    if @vote.save
---
INSERT INTO "votes" ("vice", "created_at", "treasurer", "updated_at", "secretary", "chair", "member_number") VALUES(NULL, '2009-04-01 20:40:35', NULL, '2009-04-01 20:40:35', NULL, NULL, '80510449')